common/models/CategoryModel.php

    public static function getAllCats()
    {
        $cats = ['0' => '请选择分类'];
        $data = self::find()->asArray()->all();
---
SELECT * FROM `category`